# Map External Values to DataFrame Values in Pandas
### Import Modules

In [1]:
import pandas as pd

### Create dataframe

In [2]:
raw_data = {'first_name': ['Jason', 'Molly', 'Tina', 'Jake', 'Amy'], 
        'last_name': ['Miller', 'Jacobson', 'Ali', 'Milner', 'Cooze'], 
        'age': [42, 52, 36, 24, 73], 
        'city': ['San Francisco', 'Baltimore', 'Miami', 'Douglas', 'Boston']}
df = pd.DataFrame(raw_data, columns = ['first_name', 'last_name', 'age', 'city'])
df

  first_name last_name  age           city
0      Jason    Miller   42  San Francisco
1      Molly  Jacobson   52      Baltimore
2       Tina       Ali   36          Miami
3       Jake    Milner   24        Douglas
4        Amy     Cooze   73         Boston

### Create a dictionary of values

In [3]:
city_to_state = {'San Francison':'California',
                'Baltimore':'Maryland',
                 'Miami':'Florida',
                'Douglas':'Arizona',
                'Boston':'Massachusetts'}

### Map the values of the city_to_state dictionary to the values in the city variable

In [5]:
df['state'] = df['city'].map(city_to_state)
df

  first_name last_name  age           city          state
0      Jason    Miller   42  San Francisco            NaN
1      Molly  Jacobson   52      Baltimore       Maryland
2       Tina       Ali   36          Miami        Florida
3       Jake    Milner   24        Douglas        Arizona
4        Amy     Cooze   73         Boston  Massachusetts

Source: https://chrisalbon.com/python/pandas_map_values_to_values.html